[
  {
    "file": "experiments/squaresv1.js",
    "name": "Squaresv1",
    "description": "Recreation of the art example with boxes rotating and being slightly displaced the further down you go in the loop. Started with creating two for loops to create a grid with squares, After that I added rotation and displacement."
  },

  {
    "file": "experiments/squaresv2.js",
    "name": "Squaresv2",
    "description": "Changed color space and added a low framrate to give a sort of blinking effect"
  },
  {
    "file": "experiments/squaresv3.js",
    "name": "Squaresv3(circles)",
    "description": "Circles now instead. Added a framecounter to fill up the canvas and then stop after 10 frames"
  },
  {
    "file": "experiments/noise1.js",
    "name": "Noise1(tornado)",
    "description": " Experimented around with noise. Managed to create a tornado looking thing which i thought was pretty cool. The image only uses 2 vertexes but looks like something with many lines."
  },
  {
    "file": "experiments/noise2.js",
    "name": "Noise2(largesketch)",
    "description": " Took the previous code from noise1 and changed some values and added random color, resulted in a more chaotic sketched look."
  },

  {
    "file": "experiments/noise3.js",
    "name": "Noise3(meltingtornado)",
    "description": " Wanted to see what happened if i added two clasing counters to the shape."
  },
  {
    "file": "experiments/noise4.js",
    "name": "Noise4(tornadobounce)",
    "description": " Added a way to reverse the movement creating an infinte bounce up and down."
  },
  {
    "file": "experiments/flowfield1.js",
    "name": "Flowfield",
    "description": "Flowfield made with particles and perlin noise. Art inspired by Barney Codes"
  },
  {
    "file": "experiments/flowfield1_1.js",
    "name": "Dark Camo",
    "description": "Update of the previous flowfield. I moved the background into the setup resulting in everfilling camo effect"
  },
  {
    "file": "experiments/flowfield1_2.js",
    "name": "Speedy circles",
    "description": "Changed into ellipses that shrink, added a feature that enlarges and changed color on click."
  },
  {
    "file": "experiments/flowfield1_3.js",
    "name": "Moon",
    "description": "Inspired by Lines 2,2017 by Tyler Hobbs (https://www.tylerxhobbs.com/works/lines-2)."
  }
]
